```google_compute_instance.workernode[1]: Refreshing state... [id=projects/kubepractices/zones/europe-west4-a/instances/workernode-1]
google_compute_instance.workernode[2]: Refreshing state... [id=projects/kubepractices/zones/europe-west4-a/instances/workernode-2]
google_compute_instance.workernode[0]: Refreshing state... [id=projects/kubepractices/zones/europe-west4-a/instances/workernode-0]
google_compute_instance.controlnode[0]: Refreshing state... [id=projects/kubepractices/zones/europe-west4-a/instances/controlnode-0]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # google_compute_instance.controlnode[0] has been changed
  ~ resource "google_compute_instance" "controlnode" {
        id                   = "projects/kubepractices/zones/europe-west4-a/instances/controlnode-0"
      + labels               = {}
      + metadata             = {}
        name                 = "controlnode-0"
      + resource_policies    = []
        tags                 = [
            "controlnode",
        ]
        # (14 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }
  # google_compute_instance.workernode[2] has been changed
  ~ resource "google_compute_instance" "workernode" {
        id                   = "projects/kubepractices/zones/europe-west4-a/instances/workernode-2"
      + labels               = {}
      + metadata             = {}
        name                 = "workernode-2"
      + resource_policies    = []
        tags                 = [
            "workernode",
        ]
        # (14 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }
  # google_compute_instance.workernode[0] has been changed
  ~ resource "google_compute_instance" "workernode" {
        id                   = "projects/kubepractices/zones/europe-west4-a/instances/workernode-0"
      + labels               = {}
      + metadata             = {}
        name                 = "workernode-0"
      + resource_policies    = []
        tags                 = [
            "workernode",
        ]
        # (14 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }
  # google_compute_instance.workernode[1] has been changed
  ~ resource "google_compute_instance" "workernode" {
        id                   = "projects/kubepractices/zones/europe-west4-a/instances/workernode-1"
      + labels               = {}
      + metadata             = {}
        name                 = "workernode-1"
      + resource_policies    = []
        tags                 = [
            "workernode",
        ]
        # (14 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # google_compute_firewall.default will be created
  + resource "google_compute_firewall" "default" {
      + creation_timestamp = (known after apply)
      + destination_ranges = (known after apply)
      + direction          = (known after apply)
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "default"
      + network            = "k8s-network"
      + priority           = 1000
      + project            = (known after apply)
      + self_link          = (known after apply)
      + source_ranges      = (known after apply)

      + allow {
          + ports    = [
              + "22",
            ]
          + protocol = "tcp"
        }
      + allow {
          + ports    = []
          + protocol = "icmp"
        }
    }

  # google_compute_firewall.k8s_controlnode_rule will be created
  + resource "google_compute_firewall" "k8s_controlnode_rule" {
      + creation_timestamp = (known after apply)
      + destination_ranges = (known after apply)
      + direction          = (known after apply)
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "k8s-controlnode-rule"
      + network            = "k8s-network"
      + priority           = 1000
      + project            = (known after apply)
      + self_link          = (known after apply)
      + source_ranges      = (known after apply)
      + target_tags        = [
          + "controlnode",
        ]

      + allow {
          + ports    = [
              + "6443",
              + "2379-2380",
              + "10250",
              + "10251",
              + "10252",
            ]
          + protocol = "tcp"
        }
    }

  # google_compute_firewall.k8s_workernode_rule will be created
  + resource "google_compute_firewall" "k8s_workernode_rule" {
      + creation_timestamp = (known after apply)
      + destination_ranges = (known after apply)
      + direction          = (known after apply)
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "k8s-workernode-rule"
      + network            = "k8s-network"
      + priority           = 1000
      + project            = (known after apply)
      + self_link          = (known after apply)
      + source_ranges      = (known after apply)
      + target_tags        = [
          + "workernode",
        ]

      + allow {
          + ports    = [
              + "10250",
              + "30000-32767",
            ]
          + protocol = "tcp"
        }
    }

  # google_compute_instance.controlnode[0] will be updated in-place
  ~ resource "google_compute_instance" "controlnode" {
        id                   = "projects/kubepractices/zones/europe-west4-a/instances/controlnode-0"
        name                 = "controlnode-0"
        tags                 = [
            "controlnode",
        ]
        # (17 unchanged attributes hidden)


      ~ network_interface {
            name               = "nic0"
          ~ network            = "https://www.googleapis.com/compute/v1/projects/kubepractices/global/networks/default" -> "k8s-network"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # google_compute_instance.workernode[0] will be updated in-place
  ~ resource "google_compute_instance" "workernode" {
        id                   = "projects/kubepractices/zones/europe-west4-a/instances/workernode-0"
        name                 = "workernode-0"
        tags                 = [
            "workernode",
        ]
        # (17 unchanged attributes hidden)


      ~ network_interface {
            name               = "nic0"
          ~ network            = "https://www.googleapis.com/compute/v1/projects/kubepractices/global/networks/default" -> "k8s-network"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # google_compute_instance.workernode[1] will be updated in-place
  ~ resource "google_compute_instance" "workernode" {
        id                   = "projects/kubepractices/zones/europe-west4-a/instances/workernode-1"
        name                 = "workernode-1"
        tags                 = [
            "workernode",
        ]
        # (17 unchanged attributes hidden)


      ~ network_interface {
            name               = "nic0"
          ~ network            = "https://www.googleapis.com/compute/v1/projects/kubepractices/global/networks/default" -> "k8s-network"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # google_compute_instance.workernode[2] will be updated in-place
  ~ resource "google_compute_instance" "workernode" {
        id                   = "projects/kubepractices/zones/europe-west4-a/instances/workernode-2"
        name                 = "workernode-2"
        tags                 = [
            "workernode",
        ]
        # (17 unchanged attributes hidden)


      ~ network_interface {
            name               = "nic0"
          ~ network            = "https://www.googleapis.com/compute/v1/projects/kubepractices/global/networks/default" -> "k8s-network"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # google_compute_network.vcp will be created
  + resource "google_compute_network" "vcp" {
      + auto_create_subnetworks         = true
      + delete_default_routes_on_create = false
      + gateway_ipv4                    = (known after apply)
      + id                              = (known after apply)
      + mtu                             = (known after apply)
      + name                            = "k8s-network"
      + project                         = (known after apply)
      + routing_mode                    = (known after apply)
      + self_link                       = (known after apply)
    }

Plan: 4 to add, 4 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```